package util;
public class Menu{
    public static void exibir(){
        //menu inicial
    String texto = "\n--- BEM-VINDOS ---\n--- ACADEMIA POWERFIT ---\n";
        for (char letra : texto.toCharArray()) {
System.out.print(letra);
            Thread.sleep(50);
}

//logo inicial(Que coisa feia)
System.out.println("""
██████╗  ██████╗ ██╗    ██╗███████╗██████╗ ███████╗██╗████████╗
██╔══██╗██╔═══██╗██║    ██║██╔════╝██╔══██╗██╔════╝██║╚══██╔══╝
██████╔╝██║   ██║██║ █╗ ██║█████╗  ██████╔╝█████╗  ██║   ██║
██╔═══╝ ██║   ██║██║███╗██║██╔══╝  ██╔══██╗██╔══╝  ██║   ██║
██║     ╚██████╔╝╚███╔███╔╝███████╗██║  ██║██║     ██║   ██║
╚═╝      ╚═════╝  ╚══╝╚══╝ ╚══════╝╚═╝  ╚═╝╚═╝     ╚═╝   ╚═╝
""");
//Menu
System.out.println("----------------------------------------------------------");
System.out.println("                         MENU");
System.out.println("----------------------------------------------------------");
System.out.println("1 - Login");
System.out.println("2 - Cadastro");
System.out.println("3 - Planos");
System.out.println("4 - Login de profissional");
System.out.println("5 - Cadastro de funcionário");
System.out.println("6 - Encerrar sistema");
System.out.println("----------------------------------------------------------");
System.out.print("Escolha uma opção: ");
    int opcao = sc.nextInt();
        sc.nextLine();

    }
}